clear all;

R1 = 1000;
h1 = 3000;  
z1 = h1;
G = 6.67*10^(-5);  %单位g.u.
p1 = 1*10^3;
S1 = pi*R1^2;
d1 = p1*S1;

R2 = 3000;
h2 = 6000;  
z2 = h2;
G = 6.67*10^(-5);  %单位g.u.
p2 = 0.8*10^3;
S2 = pi*R2^2;
d2 = p2*S2;

h = 500;              %向上延拓的值  （只能是500的倍数）
hh = h/500;


for i = 1:500
    x = 80*(i-250);
    g(i) = 2*G*d1*h1/((x+6000)^2+h1^2)+2*G*d2*h2/(x^2+h2^2);  %两水平无限长圆柱体相差500米
end

g = g';      %   将 g 转置
for i = 1+9*hh : 500-9*hh
    f(i-9*hh,hh) = 0;
    f(i-9*hh,1) = 0.2951*g(i,1) + 0.1653*(g(hh+i,1) + g(-hh+i,1)) + 0.066*(g(2*hh+i,1) + g(-2*hh+i,1)) ...
        + 0.0325*(g(3*hh+i,1) + g(-3*hh+i,1)) + 0.019*(g(4*hh+i,1) + g(-4*hh+i,1)) ...
        + 0.0124*(g(5*hh+i,1) + g(-5*hh+i,1)) + 0.0087*(g(6*hh+i,1) + g(-6*hh+i,1)) ...
        + 0.0064*(g(7*hh+i,1) + g(-7*hh+i,1)) + 0.0049*(g(8*hh+i,1) + g(-8*hh+i,1)) ...
        + 0.003*(g(9*hh+i,1) + g(-9*hh+i,1)) ;
end
f = f';      % 将 f 转置
g = g';     %  将 g 转置

for i = 1:9*hh
    g(501-i) = [];    %  去掉 g 的后9*h1个值
end
for i = 1:9*hh
    g(i) = [];            %  去掉 g 的前9*h1个值
end
g = [f;g];              %  将延拓后的 f 与 g 合并

x = -80*241:80:80*240;
figure(1)
hold on
plot(x,g(1+hh,:))
plot(x,g(1,:));
xlabel('x方向(mS)');
ylabel('异常(g.u.)');
title('重力异常');
legend('表面异常','向上延拓后的异常');
hold off