clear all;

R1 = 1000;
h1 = 3000;  
z1 = h1;
G = 6.67*10^(-5);  %单位g.u.
p1 = 1*10^3;
S1 = pi*R1^2;
d1 = p1*S1;

R2 = 1000;
h2 = 3000;  
z2 = h2;
G = 6.67*10^(-5);  %单位g.u.
p2 = 1*10^3;
S2 = pi*R2^2;
d2 = p2*S2;


for i = 1:500
    x = 80*(i-250);
    g(i) = 2*G*d1*h1/((x+3500)^2+h1^2)+2*G*d2*h2/(x^2+h2^2);  %两水平无限长圆柱体相差500米
end

 
y = rand(size(g));
g1 = g + 8*y;

for i = 3:497
    g_hua(i) = (1/35)*(17*g1(i) + 12*(g1(i-1) + g1(i+1)) - 3*(g1(i-2) + g1(i+2)));
end

for i = 11:490
    dg(i-10) = 1.2732*g(i) - 0.3979*(g(i-1) + g(i+1)) - 0.1061*(g(i+2) + g(i-2)) -0.0398*...
        (g(i+3) + g(i-3)) - 0.0212*(g(i+4) + g(i-4))- 0.0133*(g(i+5) + g(i-5)) - 0.0091*...
        (g(i+6) + g(i-6)) - 0.0066*(g(i+7) + g(i-7)) - 0.0051*(g(i+8) + g(i-8)) - 0.004*...
        (g(i+9) + g(i-9)) - 0.0024*(g(i+10) - g(i-10));
end

x = -80*250:80:80*249;
figure(1)
plot(x,g);
xlabel('x方向(m)');
ylabel('异常(g.u.)');
title('异常')
x = -80*240:80:80*239;
figure(2)
plot(x,dg*1000);
xlabel('x方向(m)');
ylabel('导数(E)');
title('导函数')
x = -80*250:80:80*249;
figure(3)
plot(x,g1);
xlabel('x方向(m)');
ylabel('异常(g.u.)');
title('加噪后')
x = -80*249:80:80*247;
figure(4)
plot(x,g_hua);
xlabel('x方向(m)');
ylabel('异常(g.u.)');
title('去噪后')

